生成启动时间为 2017/8/19 15:42:06。
     1>项目“E:\documents\visual studio 2015\Projects\DayDayUp\02C和C++\C++内存模型\C++内存模型\C++内存模型.vcxproj”在节点 2 上(Build 个目标)。
     1>ClCompile:
         D:\Microsoft Visual Studio 14.0\VC\bin\CL.exe /c /ZI /nologo /W3 /WX- /sdl /Od /Oy- /D _UNICODE /D UNICODE /Gm /EHsc /RTC1 /MDd /GS /fp:precise /Zc:wchar_t /Zc:forScope /Zc:inline /Fo"Debug\\" /Fd"Debug\vc140.pdb" /Gd /TP /analyze- /errorReport:prompt /d1 reportSingleClassLayoutB test.cpp
         test.cpp
         class _s__RTTIBaseClassDescriptor2	size(28):
         	+---
          0	| pTypeDescriptor
          4	| numContainedBases
          8	| _PMD where
         20	| attributes
         24	| pClassDescriptor
         	+---
         
         
         
         class _s__RTTIBaseClassArray	size(1):
         	+---
          0	| arrayOfBaseClassDescriptors
         	+---
         
         
         
         class ?$_Bitwise_hash@_N	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@D	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@C	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@E	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@_S	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@_U	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@_W	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@F	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@G	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@H	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@I	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@J	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@K	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@_J	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@_K	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@M	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@N	size(1):
         	+---
         	+---
         
         
         
         class ?$_Bitwise_hash@O	size(1):
         	+---
         	+---
         
         
         
         class ?$add_lvalue_reference@$$CBX	size(1):
         	+---
         	+---
         
         
         
         class ?$add_rvalue_reference@$$CBX	size(1):
         	+---
         	+---
         
         
         
         class __JUMP_BUFFER	size(64):
         	+---
          0	| Ebp
          4	| Ebx
          8	| Edi
         12	| Esi
         16	| Esp
         20	| Eip
         24	| Registration
         28	| TryLevel
         32	| Cookie
         36	| UnwindFunc
         40	| UnwindData
         	+---
         
         
         
         class _Bxty	size(0):
         	+---
          0	| _Buf
          0	| _Ptr
          0	| _Alias
         	+---
         
         
         
         class ?$remove_volatile@$$CBD	size(1):
         	+---
         	+---
         
         
         
         class ?$remove_const@$$CBD	size(1):
         	+---
         	+---
         
         
         
         class ?$remove_cv@$$CBD	size(1):
         	+---
         	+---
         
         
         
         class ?$is_void@$$CBD	size(1):
         	+---
         	| +--- (base class ?$_Is_void@D)
         	| | +--- (base class ?$integral_constant@_N$0A@)
         	| | +---
         	| +---
         	+---
         
         
         
         class ?$_If@$0A@$$CBH$$CBD	size(1):
         	+---
         	+---
         
         
         
         class ?$is_same@PBDPBD	size(1):
         	+---
         	| +--- (base class ?$integral_constant@_N$00)
         	| +---
         	+---
         
         
         
         class ?$is_same@ABDABD	size(1):
         	+---
         	| +--- (base class ?$integral_constant@_N$00)
         	| +---
         	+---
         
         
         
         class ?$_If@$00U?$_Simple_types@D@std@@U?$_String_iter_types@DIHPADPBDAADABD@2@	size(1):
         	+---
         	+---
         
         
         
         class _Bxty	size(16):
         	+---
          0	| _Buf
          0	| _Ptr
          0	| _Alias
         	+---
         
         
         
         class ?$is_error_code_enum@PBD	size(1):
         	+---
         	| +--- (base class ?$integral_constant@_N$0A@)
         	| +---
         	+---
         
         
         
         class B	size(12):
         	+---
         	| +--- (base class A)
          0	| | {vfptr}
          4	| | a
         	| +---
          8	| b
         	+---
         
         B::$vftable@:
         	| &B_meta
         	|  0
          0	| &A::funa 
          1	| &A::funb 
          2	| &B::funb 
          3	| &B::func 
         
         B::funb this adjustor: 0
         B::func this adjustor: 0
         
         
         class ?$remove_volatile@$$CB_W	size(1):
         	+---
         	+---
         
         
         
         class ?$remove_const@$$CB_W	size(1):
         	+---
         	+---
         
         
         
         class ?$remove_cv@$$CB_W	size(1):
         	+---
         	+---
         
         
         
         class ?$is_void@$$CB_W	size(1):
         	+---
         	| +--- (base class ?$_Is_void@_W)
         	| | +--- (base class ?$integral_constant@_N$0A@)
         	| | +---
         	| +---
         	+---
         
         
         
         class ?$_If@$0A@$$CBH$$CB_W	size(1):
         	+---
         	+---
         
         
         
         class ?$is_same@PB_WPB_W	size(1):
         	+---
         	| +--- (base class ?$integral_constant@_N$00)
         	| +---
         	+---
         
         
         
         class ?$is_same@AB_WAB_W	size(1):
         	+---
         	| +--- (base class ?$integral_constant@_N$00)
         	| +---
         	+---
         
         
         
         class ?$_If@$00U?$_Simple_types@_W@std@@U?$_String_iter_types@_WIHPA_WPB_WAA_WAB_W@2@	size(1):
         	+---
         	+---
         
         
         
         class _Bxty	size(16):
         	+---
          0	| _Buf
          0	| _Ptr
          0	| _Alias
         	+---
         
         
         
         class ?$_Iterator012@Urandom_access_iterator_tag@std@@DHPBDABDU_Iterator_base12@2@	size(8):
         	+---
         	| +--- (base class _Iterator_base12)
          0	| | _Myproxy
          4	| | _Mynextiter
         	| +---
         	+---
         
         
         
         class ?$iterator@Uinput_iterator_tag@std@@_W_JPB_W_W	size(1):
         	+---
         	+---
         
         
         
         class ?$iterator@Uinput_iterator_tag@std@@D_JPBDD	size(1):
         	+---
         	+---
         
         
         
         class ?$_Iterator012@Urandom_access_iterator_tag@std@@_WHPB_WAB_WU_Iterator_base12@2@	size(8):
         	+---
         	| +--- (base class _Iterator_base12)
          0	| | _Myproxy
          4	| | _Mynextiter
         	| +---
         	+---
         
         
         
         class ?$add_rvalue_reference@T_Bxty@?$_String_val@U?$_Simple_types@D@std@@@std@@	size(1):
         	+---
         	+---
         
         
         
         class ?$is_nothrow_constructible@T_Bxty@?$_String_val@U?$_Simple_types@D@std@@@std@@$$QAT123@	size(1):
         	+---
         	| +--- (base class ?$_Cat_base@$00)
         	| | +--- (base class ?$integral_constant@_N$00)
         	| | +---
         	| +---
         	+---
         
         
         
         class ?$is_nothrow_move_constructible@T_Bxty@?$_String_val@U?$_Simple_types@D@std@@@std@@	size(1):
         	+---
         	| +--- (base class ?$integral_constant@_N$00)
         	| +---
         	+---
         
         
         
         class ?$add_lvalue_reference@T_Bxty@?$_String_val@U?$_Simple_types@D@std@@@std@@	size(1):
         	+---
         	+---
         
         
         
         class ?$is_nothrow_assignable@AAT_Bxty@?$_String_val@U?$_Simple_types@D@std@@@std@@$$QAT123@	size(1):
         	+---
         	| +--- (base class ?$_Cat_base@$00)
         	| | +--- (base class ?$integral_constant@_N$00)
         	| | +---
         	| +---
         	+---
         
         
         
         class ?$is_nothrow_move_assignable@T_Bxty@?$_String_val@U?$_Simple_types@D@std@@@std@@	size(1):
         	+---
         	| +--- (base class ?$integral_constant@_N$00)
         	| +---
         	+---
         
         
         
         class ?$remove_volatile@$$CBU_Container_proxy@std@@	size(1):
         	+---
         	+---
         
         
         
         class ?$remove_const@$$CBU_Container_proxy@std@@	size(1):
         	+---
         	+---
         
         
         
         class ?$remove_cv@$$CBU_Container_proxy@std@@	size(1):
         	+---
         	+---
         
         
         
         class ?$is_void@$$CBU_Container_proxy@std@@	size(1):
         	+---
         	| +--- (base class ?$_Is_void@U_Container_proxy@std@@)
         	| | +--- (base class ?$integral_constant@_N$0A@)
         	| | +---
         	| +---
         	+---
         
         
         
         class ?$_If@$0A@$$CBH$$CBU_Container_proxy@std@@	size(1):
         	+---
         	+---
         
         
         
         class ?$__vcrt_va_list_is_reference@QB_W	size(1):
         	+---
         	+---
         
         
         
         class ?$__vcrt_va_list_is_reference@PB_W	size(1):
         	+---
         	+---
         
         
         
         class ?$__vcrt_va_list_is_reference@QBD	size(1):
         	+---
         	+---
         
         
         
         class ?$iterator_traits@PBD	size(1):
         	+---
         	+---
         
         
         
         class ?$iterator_traits@PB_W	size(1):
         	+---
         	+---
         
         
         
         class ?$iterator_traits@PBG	size(1):
         	+---
         	+---
         
         
         
         class ?$_Param_tester@Uinput_iterator_tag@std@@_W_JPB_W_W	size(1):
         	+---
         	+---
         
         
         
         class ?$_Param_tester@Uinput_iterator_tag@std@@D_JPBDD	size(1):
         	+---
         	+---
         
         
         
         class ?$remove_reference@ABV?$allocator@D@std@@	size(1):
         	+---
         	+---
         
         
         
         class ?$remove_reference@AAT_Bxty@?$_String_val@U?$_Simple_types@D@std@@@std@@	size(1):
         	+---
         	+---
         
         
         
         class ?$remove_reference@ABV?$allocator@_W@std@@	size(1):
         	+---
         	+---
         
         
         
       Link:
         D:\Microsoft Visual Studio 14.0\VC\bin\link.exe /ERRORREPORT:PROMPT /OUT:"E:\documents\visual studio 2015\Projects\DayDayUp\02C和C++\C++内存模型\Debug\C++内存模型.exe" /INCREMENTAL /NOLOGO kernel32.lib user32.lib gdi32.lib winspool.lib comdlg32.lib advapi32.lib shell32.lib ole32.lib oleaut32.lib uuid.lib odbc32.lib odbccp32.lib /MANIFEST /MANIFESTUAC:"level='asInvoker' uiAccess='false'" /manifest:embed /Debug /PDB:"E:\documents\visual studio 2015\Projects\DayDayUp\02C和C++\C++内存模型\Debug\C++内存模型.pdb" /TLBID:1 /DYNAMICBASE /NXCOMPAT /IMPLIB:"E:\documents\visual studio 2015\Projects\DayDayUp\02C和C++\C++内存模型\Debug\C++内存模型.lib" /MACHINE:X86 Debug\test.obj
     1>test.obj : error LNK2019: 无法解析的外部符号 "int __cdecl fun(int)" (?fun@@YAHH@Z)，该符号在函数 _main 中被引用
     1>E:\documents\visual studio 2015\Projects\DayDayUp\02C和C++\C++内存模型\Debug\C++内存模型.exe : fatal error LNK1120: 1 个无法解析的外部命令
     1>已完成生成项目“E:\documents\visual studio 2015\Projects\DayDayUp\02C和C++\C++内存模型\C++内存模型\C++内存模型.vcxproj”(Build 个目标)的操作 - 失败。

生成失败。

已用时间 00:00:03.63
